acoolbest/charge_STM32F103ZET6/User/main.c
/**
 ******************************************************************************
 * @file    main.c
 * @author  fire
 * @version V1.0
 * @date    2013-xx-xx
 * @brief   液晶触摸画板实验
 ******************************************************************************
 * @attention
 *
 * 实验平台:野火 ISO-MINI STM32 开发板 
 * 论坛    :http://www.chuxue123.com
 * 淘宝    :http://firestm32.taobao.com
 *
 ******************************************************************************
 */ 

#include "stm32f10x.h"

//#define ZHZQ_TEST

static u32 check_time = 0;

void uart1_cmd (void)
{
	u16 last_i;
	u8 last_d;
	UART1_Receive_Length = UART1_RXBUFFE_LAST - UART1_RXBUFFE_HEAD;
	UART1_Receive_Length &= UART1_RX_MAX;//最大字节
	/********定义的字符作为一帧数据的结束标识************/
	if(UART1_Receive_Length > 0 )	//只有接收到1个数据以上才做判断
	{
		if(UART1_RXBUFFER[UART1_RXBUFFE_HEAD] == frame_headerC) 	//帧起始标志   
		{
			UART1_RX_State = 1;
			if((UART1_Receive_Length >= 2)&&((UART1_Receive_Pointer[(UART1_RXBUFFE_HEAD+1)&UART1_RX_MAX]<<1) <= UART1_Receive_Length)) 	//长度刚好标志   
			{
				UART1_RX_State |= 2;
				last_i = UART1_RXBUFFE_HEAD+(UART1_Receive_Pointer[(UART1_RXBUFFE_HEAD+1)&UART1_RX_MAX]<<1)-1;
				last_i &= UART1_RX_MAX;
				last_d = UART1_Receive_Pointer[last_i];
				if((last_d == frame_last))//校验对上
				{
					testcmd1_time = time_s;
					if((UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+2)&UART1_RX_MAX] ==device.addr) || (UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+2)&UART1_RX_MAX] ==GLOBLE_ADDR)) 
					{			
						switch(UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+4)&UART1_RX_MAX])
						{    		
							//					case 0x51:  cmd_Device_Info();		    break;//获取设备信息
							case 0x53:  cmd_Port_Info();		    		break;//获取端口信息
							case 0x55:  cmd_Device_Check();		    	break;//核对信息
							case 0x57:  cmd_Device_num();		    		break;//设备号
							case 0x59:  cmd_Power_off();		    		break;//断电命令
							case 0x5a:  cmd_Power_on();		    			break;//上电命令

								    //		          case 0x10:  cmd_Hub_Rst();						  break;//复位HUB		 
							case 0x11:  cmd_File_Requst();		    	break;//文件操作请求
							case 0x12:  cmd_File_Tx();		    			break;//文件传输
							case 0x13:  cmd_File_Recall();		    	break;//文件调用
							case 0x14:  cmd_File_Erase();		    		break;//文件擦除
							case 0x16:  cmd_ShakeHands();		    break;//握手
							case 0x30:  cmd_MediaCtrl();   				break;//媒体控制命令
							case 0x3E:  Device_Rst();   				break;//复位设备

								    //          case 0xE1:  cmd_Get_State();   			break;//读HUB号到
								    //          case 0xE2:  cmd_Set_State();   			break;//设置HUB号到FLASH
							case 0xE3:  cmd_Erase_Flash();      	break;//
							case 0xE4:  cmd_Read_Flash();       	break;//
							case 0xE5:  cmd_Write_Flash();      	break;//						
							case 0xE6:  cmd_Get_ADC();      			break;//						
							case 0xE7:  cmd_Save_ADC();   				break;//保存ADC基线
							case 0xE8:  cmd_RGB888_565();   			break;//
							case 0xE9:  cmd_RGB_clear();   			  break;//

							default:	    break;		   	
						}//end switch
					}
					else
						if((UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+2)&UART1_RX_MAX] ==Broadcast)) 
						{
							switch(UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+4)&UART1_RX_MAX])
							{    		
								//          case 0x10:  cmd_Hub_Rst();		    	break;//复位HUB		 
								//					case 0x51:  cmd_device_info();		  break;//获取设备信息

								default:	    break;		   	
							}//end switch
						}
						else
							if((UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+3)&UART1_RX_MAX] ==PC_ADDR))   
							{
								switch(UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+4)&UART1_RX_MAX])
								{    		
									case 0x10:  cmd_Hub_Rst();		    	break;//复位HUB		 
										    //					case 0x51:  cmd_device_info();		  break;//获取设备信息

									default:	    break;		   	
								}//end switch
							}
				}
				else//校验对不上
				{
					UART1_RX_State |= 0xe0;
				}
			}						
			else
			{
				if( (time_sys -time_uart1)>100 )
				{
					UART1_RX_State |= 0xe0;						
					//					BUS_Error_Byte(0x11);
				}
				else
				{
					UART1_RX_State = 0x00;
				}
			}

		}
		else
		{
			UART1_RX_State |= 0xe0;
		}

		if((UART1_RX_State &0xe0)== 0xe0)	//接收出错
		{
			UART1_RXBUFFE_HEAD +=1;
			UART1_RXBUFFE_HEAD &= UART1_RX_MAX;//最大字节
		}
		else
			if(UART1_RX_State ==0)   //等待接收完成
			{
				// 				UART1_RXBUFFE_HEAD +=0;
				// 				UART1_RXBUFFE_HEAD &= UART1_RX_MAX;//最大字节
			}
			else//接收完成
			{
				UART1_RXBUFFE_HEAD += (UART1_RXBUFFER[(UART1_RXBUFFE_HEAD+1)&UART1_RX_MAX]<<1);
				UART1_RXBUFFE_HEAD &= UART1_RX_MAX;//最大字节
			}
		UART1_RX_State =0;
	}   //len >0

} 
void uart3_cmd (void)
{
	UART3_Receive_Length = UART3_RXBUFFE_LAST - UART3_RXBUFFE_HEAD;
	UART3_Receive_Length &= UART3_RX_MAX;//最大字节
	/********定义的字符作为一帧数据的结束标识************/
	if(UART3_Receive_Length > 0 )	//只有接收到1个数据以上才做判断
	{
		if(UART3_RXBUFFER[UART3_RXBUFFE_HEAD] == frame_headerC) 	//帧起始标志   
		{
			UART3_RX_State = 1;

			if((UART3_Receive_Length >= 2)&&((UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+1)&UART3_RX_MAX]) <= (UART3_Receive_Length>>1))) 	//长度刚好标志   
			{
				UART3_RX_State |= 2;
				if((UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+2)&UART3_RX_MAX] ==device.addr) || (UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+2)&UART3_RX_MAX] ==GLOBLE_ADDR)) 
				{			
					switch(UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+4)&UART3_RX_MAX])
					{    		
						//          case 0x10:  cmd_Hub_Ctrl();		break;//复位		 
						//					case 0x51:  charge_device_info();		    break;//获取设备信息
						//		  		case 0x16:  Test_device();		    			break;//
						case 0x16:  cmd3_ShakeHands();		    break;//握手

						case 0xE1:  cmd3_Get_State();   			break;//读HUB号到
						case 0xE2:  cmd3_Set_State();   			break;//  设置HUB号到FLASH
							    //          case 0xE3:  cmd_Erase_Flash();      break;//
							    //          case 0xE4:  cmd_Read_Flash();       break;//
							    //          case 0xE5:  cmd_Write_Flash();      break;//

						default:	    break;		   	
					}//end switch
				}
				else
					if((UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+4)&UART3_RX_MAX] ==0xe2)) 
					{
						//          case 0xE2:  
						cmd3_Set_State();   		//  设置HUB号到FLASH
					}
				UART3_RXBUFFE_HEAD += (UART3_RXBUFFER[(UART3_RXBUFFE_HEAD+1)&UART3_RX_MAX]<<1);
				UART3_RXBUFFE_HEAD &= UART3_RX_MAX;//最大字节
			}
		}
		else
		{
			UART3_RX_State = 0;
			UART3_RXBUFFE_HEAD +=1;
			UART3_RXBUFFE_HEAD &= UART3_RX_MAX;//最大字节
		}

