acoolbest/charge_STM32F103ZET6/User/main.c
	}
} 


/**
  * @brief  Enables or disables the High Speed APB (APB2) peripheral clock.
  * @param  RCC_APB2Periph: specifies the APB2 peripheral to gates its clock.
  *   This parameter can be any combination of the following values:
  *     @arg RCC_APB2Periph_AFIO, RCC_APB2Periph_GPIOA, RCC_APB2Periph_GPIOB,
  *          RCC_APB2Periph_GPIOC, RCC_APB2Periph_GPIOD, RCC_APB2Periph_GPIOE,
  *          RCC_APB2Periph_GPIOF, RCC_APB2Periph_GPIOG, RCC_APB2Periph_ADC1,
  *          RCC_APB2Periph_ADC2, RCC_APB2Periph_TIM1, RCC_APB2Periph_SPI1,
  *          RCC_APB2Periph_TIM8, RCC_APB2Periph_USART1, RCC_APB2Periph_ADC3,
  *          RCC_APB2Periph_TIM15, RCC_APB2Periph_TIM16, RCC_APB2Periph_TIM17,
  *          RCC_APB2Periph_TIM9, RCC_APB2Periph_TIM10, RCC_APB2Periph_TIM11     
  * @param  NewState: new state of the specified peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void init_base_data(void)
{
	device.Version[0] = 17; //2017年
	device.Version[1] = 41; //4月第1版
	step =0;
	time_s = 0;
	time_sys = 0;
	check_time = time_sys;
	device.TASK_state =0x00;
	
	//初始时间
	memset(Uport_PowerUseTime, 0, sizeof(Uport_PowerUseTime));
	memset(Uport_PowerShowTime, 0, sizeof(Uport_PowerShowTime));
	
	Delay_ms(150);	
	GPIO_NegationBits(LED_PORT, LED_PIN);
	Delay_ms(150);	
	GPIO_NegationBits(LED_PORT, LED_PIN);
	Delay_ms(150);	
	GPIO_NegationBits(LED_PORT, LED_PIN);
	Delay_ms(150);	
	GPIO_NegationBits(LED_PORT, LED_PIN);
	Delay_ms(150);	
	GPIO_NegationBits(LED_PORT, LED_PIN);
	Delay_ms(150);	
	GPIO_NegationBits(LED_PORT, LED_PIN);
}

/**
  * @brief  Enables or disables the High Speed ADC1 and ADC3 peripheral clock.
  * @param  NewState: new state of the specified peripheral clock.
  *   This parameter can be: ENABLE or DISABLE.
  * @retval None
  */
void ADC1_3_PeriphClockCmd(FunctionalState NewState)
{
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC1, NewState);
	RCC_APB2PeriphClockCmd(RCC_APB2Periph_ADC3, NewState);
}

void init_LCD_background(void)
{
	LCDC.LCDPOFFTIME[LCD1_INDEX] = 0XFF;
	LCDC.LCDPOFFTIME[LCD2_INDEX] = 0XFF;
	LCDC.PSwitch = 1;
	LCDC.SPSwitch = 1;
	LCDC.PNum = 0;
	LCDC.LCDPTimeSet = 15;  
	LCDC.LCDPTime[LCD1_INDEX] = 0;
	LCDC.LCDPTime[LCD2_INDEX] = 0;
	LCDC.LCDPID[LCD1_INDEX] =0;
	LCDC.LCDPID[LCD2_INDEX] =0;
	LCDC.LCDSPTimeSet = 60;   //屏保
	LCDC.LCDSPTime[LCD1_INDEX] = 0;
	LCDC.LCDSPTime[LCD2_INDEX] = 0;
	LCDC.LCDSPPID[LCD1_INDEX] =0;
	LCDC.LCDSPPID[LCD2_INDEX] =0;
	
	ADC1_3_PeriphClockCmd(DISABLE);
	display_flash_BMPE (0,0,3,LCDC.LCDSPPID[LCD1_INDEX],3);//单色彩色都支持 调背景
	ADC1_3_PeriphClockCmd(ENABLE);
}

void init_LCD_config()
{
	GPIO_ResetBits(LCD_RST_PORT, LCD_RST_PIN);
	LCD_Init(); 
	LCD_Init1();	
	GPIO_ResetBits(LCD_CS1_PORT, LCD_CS1_PIN);
	GPIO_ResetBits(LCD_CS2_PORT, LCD_CS2_PIN);
	LCD_Clear(RED);
	LCD_Clear(GREEN);
	LCD_Clear(BLUE);
	//tft_16bitdeep_BMP (220,0,gImage11_240_100_16bitC);		//原LOGO
	GPIO_SetBits(LCD_CS1_PORT, LCD_CS1_PIN);
	GPIO_SetBits(LCD_CS2_PORT, LCD_CS2_PIN);
}

static void init_all_local_data_and_display(void)
{
	u32 i = 0;
	FLASH2_GPIOSPI_Read (Addr_04min, str_buffer, 64);  //读取图片张数
	if(str_buffer[0] == 0x67)//项有效
	{
		LCDC.PNum = str_buffer[1];
	}
	FLASH2_GPIOSPI_Read (Addr_info2, &info2STR.head[0], sizeof(info2STR));	//媒休初始化
	if(info2STR.head[0] == 0x67 && info2STR.item1[1]==3)//项有效
	{
		LCDC.PSwitch = info2STR.item1_data[0];
		LCDC.LCDPTimeSet = info2STR.item1_data[1];	
		LCDC.LCDPTimeSet <<= 8; 
		LCDC.LCDPTimeSet += info2STR.item1_data[2]; 
	}

	if(info2STR.head[0] == 0x67 && info2STR.item2[1]==3)//项有效
	{
		LCDC.SPSwitch = info2STR.item2_data[0];
		LCDC.LCDSPTimeSet = info2STR.item2_data[1];
		LCDC.LCDSPTimeSet <<= 8;	
		LCDC.LCDSPTimeSet += info2STR.item2_data[2];
	}

	//tft_DisplayStr(52, 0, AnsiChardata,POINT_COLOR, BACK_COLOR,3);

	//display_flash_BMPE (14,118,3,((Uport_PowerUseTime[0]%3600/600)+'0'),3);//时间 分H
	//display_flash_BMPE (14,139,3,((Uport_PowerUseTime[0]%600/60)+'0'),3);//时间 分L
	//display_flash_BMPE (14,174,3,((Uport_PowerUseTime[0]%60/10)+'0'),3);//时间 秒H
	//display_flash_BMPE (14,195,3,((Uport_PowerUseTime[0]%10)+'0'),3);//时间 秒L


	//获取基线,设备号
	//Addr_info,格式：0X67 LEN ADDR F0 XX XX (16字节AD基线) (12字节设备号) CHECK 0X99
	FLASH2_GPIOSPI_Read (Addr_info, str_buffer, 64);
	global_u8p = (u8*)ADC_Base0;
	for(i=0;i<16;i++)
	{
		global_u8p[i] = str_buffer[6+i];
		//global_u8p[i] = str_buffer[i];
	}
	//DisplayADC_BL(150, 0, ADC_Base0,POINT_COLOR, BACK_COLOR,1);
	//DisplayADC_BL(150, 0, &ADC_Base0[3],POINT_COLOR, BACK_COLOR,2);
	//DisplayADC_BL(150, 0, &ADC_Base0[5],POINT_COLOR, BACK_COLOR,3);

	FLASH2_GPIOSPI_Read (Addr_info1, str_buffer, 64);
	if(str_buffer[0]==frame_headerC)
	{
		for(i=0;i<12;i++)
		{
			device_num[i]= str_buffer[5+i];
		}
		device_num[i++]= ' ';
		device_num[i++]= 0;
	}
	else
	{
		for(i=0;i<12;i++)
		{
			device_num[i]= '?';
		}
		device_num[i++]= ' ';
		device_num[i++]= 0;
	}
	tft_DisplayStr(270, 125, device_num,0x0000,0xffff,3);

	//文本区初始
	//FiletoBuffer_ID(u8 area,u8 id,u8 *p);
	FiletoBuffer_ID(2,48,LCD_TxtBuffer[LCD1_INDEX]);
	FiletoBuffer_ID(2,48,LCD_TxtBuffer[LCD2_INDEX]);
	LCD_TxtBuffer[LCD1_INDEX][2048]=0;
	LCD_TxtBuffer[LCD1_INDEX][2049]=0;
	LCD_TxtBuffer[LCD2_INDEX][2048]=0;
	LCD_TxtBuffer[LCD2_INDEX][2049]=0;

	//二维码初始
	FLASH2_GPIOSPI_Read (Addr_01min, str_buffer, 128);
	if(str_buffer[0]==frame_headerC)  //判断有没有二维码
	{
		device.use &= ~0x0C; //有二维码 
	}
	else
	{
		device.use |= 0x0C;//没有二维码
	}
	if((device.use&0x04)==0x0) //有码显示
	{
		DisplayPROT_EWM(80,56,0,1);  //128
		DisplayPROT_EWM(80,56,1,2);  //128
		//DisplayPROT_EWM(126,40,1,2);	//160
	}
}

//初始化USB上电状态，关闭上电

void all_usb_port_power_off(void)
{
	u8 i = 0;
	for(i=1;i<=6;i++) usb_power_ctrl(i, USB_POWER_OFF);
}

typedef		void (*FUNC_START_ROUTINE)(void);
#define		INIT_FUNC_COUNT								9
#define		RUN_FUNC_COUNT								7

static FUNC_START_ROUTINE init_func[INIT_FUNC_COUNT] = {
	init_base_data(),
	//Addr_Set(),
	//hub_id_info(),
	all_usb_port_power_off,//初始化USB上电状态，关闭上电
	//初始LCD
	init_LCD_config(),
	init_LCD_background(),
	init_all_local_data_and_display()
};

static FUNC_START_ROUTINE run_func[RUN_FUNC_COUNT] = {
	
