acoolbest/charge_STM32F103ZET6/User/main.c
};

void check_key_press_down_to_reset_board(void)
{
	u32 i = 0;
	if(GPIO_ReadInputDataBit(KEY_PORT,KEY_PIN) ==0)  //按键=0,1S进行人为复位
	{
		//SystemReset();
		all_usb_port_power_off();
		Delay_ms(200);
		//获取基线
		Get_ADC_BaseLine();
		FLASH2_GPIOSPI_Read (Addr_info, str_buffer, 64);
		global_u8p = (u8*)ADC_Base0;
		for(i=0;i<16;i++)
		{
			str_buffer[6+i] = global_u8p[i];
		}
		str_buffer[0] = 0x67;
		str_buffer[1] = 0x16;
		str_buffer[2] = device.addr;
		str_buffer[3] = 0xf0;
		str_buffer[(str_buffer[1]<<1)-2] = 0;//check;
		for(i=1;i<((str_buffer[1]<<1)-2);i++)
		{
			str_buffer[(str_buffer[1]<<1)-2] += str_buffer[i];
		}
		str_buffer[(str_buffer[1]<<1)-1] = 0x99;

		FLASH2_GPIOSPI_SER(Addr_info);  ////每次擦擦4K
		FLASH2_GPIOSPI_Read (Addr_info, &str_buffer[200], 64);
		FLASH2_GPIOSPI_Write(Addr_info, str_buffer, (str_buffer[1]<<1));
		FLASH2_GPIOSPI_Read (Addr_info, str_buffer, 64);

		//i=100000;
		//while(i--)
		//{
		//	GPIO_SetBits(LED_PORT, LED_PIN);
		//}

		NVIC_SystemReset();
	}
}

void update_qrcode_at_regular_time(void)
{
	if(time_sys-check_time >= 5000)			//定时检测设备
	{
		check_time += 5000;
		//GPIO_NegationBits(LED_PORT, LED_PIN);
		GPIO_SetBits(LED_PORT, LED_PIN);

		if((device.use&0x10)==0x10) //二维码有更新
		{
			device.use &= ~0x10; //
			DisplayPROT_EWM(80,56,0,1);  //128
			DisplayPROT_EWM(80,56,1,2);  //128
		}
	}
}

/**
  * @brief  update LCD1 or LCD2 screen protect.
  * @param  lcd_index: specifies the LCD index.
  *   This parameter can be: LCD1_INDEX or LCD2_INDEX.
  * @retval None
  */
void update_screen_protect(u8 lcd_index)
{
	u8 lcd_cs = lcd_index+1;
	u8 file_num = lcd_index;
	if((LCDC.LCDSPTime[lcd_index]>=LCDC.LCDSPTimeSet)&&(time_sys-time_s_temp<300))//LCD更新屏保
	{
		LCDC.LCDSPTime[lcd_index] -=LCDC.LCDSPTimeSet;
		if(LCDC.LCDSPPID[lcd_index]!=2)
		{
			if(LCDC.LCDSPPID[lcd_index]<1)
			{
				LCDC.LCDSPPID[lcd_index]++;
			}
			else
			{
				LCDC.LCDSPPID[lcd_index] = 0;
			}
			display_flash_BMPE (0,0,3,LCDC.LCDSPPID[lcd_index],1);//单色彩色都支持 调背景
			if(LCDC.LCDSPPID[LCD1_INDEX]==1)
			{
				DisplayPROT_EWM(115,56,file_num,lcd_cs);  //128
				tft_DisplayStr(15, 125, device_num,0x0000,0xffff,lcd_cs);
			}
			else
			{
				DisplayPROT_EWM(80,56,file_num,lcd_cs);  //128
				tft_DisplayStr(270, 125, device_num,0x0000,0xffff,lcd_cs);
			}
		}
	}
}

void update_advertisement(u8 lcd_index)
{
	u8 lcd_cs = lcd_index+1;
	if((LCDC.LCDPTime[lcd_index]>=LCDC.LCDPTimeSet)&&(time_sys-time_s_temp<300))//LCD更新广告
	{
		LCDC.LCDPTime[lcd_index] -=LCDC.LCDPTimeSet;

		if(LCDC.PSwitch==1)
		{
			LCDC.LCDPID[lcd_index]++;
			if(LCDC.LCDPID[lcd_index]>=LCDC.PNum)
			{
				LCDC.LCDPID[lcd_index]=0;
			}
			display_flash_BMPE (116,0,4,LCDC.LCDPID[lcd_index],lcd_cs);//广告
		}
	}
}

void LCD_into_power_on_state(u8 lcd_index)
{
	u8 lcd_cs = lcd_index+1;
	u8 Uport_PowerUseTime_index = lcd_index;
	if((Uport_PowerUseTime[Uport_PowerUseTime_index]>0)&&(LCDC.LCDSPPID[lcd_index]!=2))//LCD进入充电
	{
		LCDC.LCDSPPID[lcd_index] = 2;
		display_flash_BMPE (0,0,3,LCDC.LCDSPPID[lcd_index],lcd_cs);//单色彩色都支持 调背景
	}
}

void synthesize_function(u8 lcd_index)
{
	u8 lcd_cs = lcd_index+1;
	u8 Uport_PowerUseTime_index = lcd_index;
	u8 file_num = lcd_index;
	u8 i = 0;
#if 0
	AnsiChardata[12] = Uport_PowerUseTime[Uport_PowerUseTime_index]/36000+'0';
	AnsiChardata[13] = Uport_PowerUseTime[Uport_PowerUseTime_index]%36000/3600+'0';
	AnsiChardata[19] = Uport_PowerUseTime[Uport_PowerUseTime_index]%3600/600+'0';
	AnsiChardata[20] = Uport_PowerUseTime[Uport_PowerUseTime_index]%600/60+'0';
	AnsiChardata[24] = Uport_PowerUseTime[Uport_PowerUseTime_index]%60/10+'0';
	AnsiChardata[25] = Uport_PowerUseTime[Uport_PowerUseTime_index]%10+'0';
#endif
	
	if(LCDC.LCDSPPID[lcd_index]==2)
	{
		display_flash_BMPE (18,120,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%3600/600)+'0'),lcd_cs);//时间 分H
		display_flash_BMPE (18,141,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%600/60)+'0'),lcd_cs);//时间 分L
		display_flash_BMPE (18,176,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%60/10)+'0'),lcd_cs);//时间 秒H
		display_flash_BMPE (18,197,3,((Uport_PowerShowTime[Uport_PowerUseTime_index]%10)+'0'),lcd_cs);//时间 秒L
	}
	
	if(Uport_PowerUseTime[Uport_PowerUseTime_index]>0)
	{
		Uport_PowerUseTime[Uport_PowerUseTime_index]--;
		//GPIO_SetBits(LED1_PORT, LED1_PIN);
		LCDC.LCDPOFFTIME[lcd_index]=0; //断电计时
	}
	else
	{
		//GPIO_ResetBits(LED1_PORT, LED1_PIN);
		for(i=lcd_index;i<(lcd_index+1)*3;i++)
		{
			Dport_ChargeOFF(i);
			Dport_State[i] = 0;
		}
		LCDC.LCDPTime[lcd_index]=0;		//广告计时
	}
	
	if(Uport_PowerShowTime[Uport_PowerUseTime_index]>0)
	{
		Uport_PowerShowTime[Uport_PowerUseTime_index]--;
		GPIO_SetBits(LED1_PORT, LED1_PIN);
		led_power_ctrl(u8 usb_port, u8 new_state);
	}
	else
	{
		led_power_ctrl(u8 usb_port, u8 new_state);
		GPIO_ResetBits(LED1_PORT, LED1_PIN);
	}
	
	if(LCDC.LCDPOFFTIME[lcd_index]==1)  //断电1秒调文字
	{
		FiletoBuffer_ID(2,48,LCD_TxtBuffer[lcd_index]);
		LCD_TxtBuffer[lcd_index][2048]=0;
		LCD_TxtBuffer[lcd_index][2049]=0;
	}
 	else if(LCDC.LCDPOFFTIME[lcd_index]==5)  //断电后5秒调文字
	{
		LCDC.LCDSPTime[lcd_index] = 0;  //屏保时间
		LCDC.LCDSPPID[lcd_index] = 0;
		display_flash_BMPE (0,0,3,LCDC.LCDSPPID[lcd_index],lcd_cs);//单色彩色都支持 调背景
		DisplayPROT_EWM(80,56,file_num,lcd_cs);  //128
		tft_DisplayStr(270, 125, device_num,0x0000,0xffff,lcd_cs);
	}
}

/**
 * @brief  主函数
 * @param  无  
 * @retval 无
 */
int main(void)
{
	u32 i;
	
	/* 系统定时器 1us 定时初始化 */
	SysTick_Init();
	//CPU_CRITICAL_ENTER();
	LED_GPIO_Config();
	ADC_Configuration();
	//DAC_Configuration();
	UART_Configuration();
	SPI_Configuration();
	DMA_Configuration();
	LCD_IOConfig();
	FSMC_LCDInit();
	NVIC_Configuration();
	USART_ITConfig(USART1, USART_IT_RXNE, ENABLE);
	ADC_ITConfig(ADC1, ADC_IT_EOC, ENABLE);//开中断
	ADC_ITConfig(ADC3, ADC_IT_EOC, ENABLE);//开中断
	//DMA_ITConfig(DMA1_Channel1,DMA_IT_TC,ENABLE);  //配置DMA发送完成后产生中断
	//SPI_I2S_ITConfig(SPI1, SPI_I2S_IT_RXNE, ENABLE);
	//CPU_CRITICAL_EXIT();

	for(i=0;i<INIT_FUNC_COUNT;i++) init_func[i]();

	Delay_ms(100);
	time_sys = 0;

	while(1)
	{
		for(i=0;i<RUN_FUNC_COUNT;i++) 
		{
			run_func[i]();
			uart1_cmd();
			uart3_cmd();
		}
	}
	
	while(1)
	{
		
		check_key_press_down_to_reset_board();
		
		uart1_cmd();
		uart3_cmd();

		update_qrcode_at_regular_time();

