acoolbest/charge_STM32F103ZET6/User/main.c
		#if 0
		if(UART1_Error==1)			//接收满
		{			
			UART1_Error = 0;
		}

		if(UART2_Error==1)			//接收满
		{	

		}
		#endif
		
		uart1_cmd();
		uart3_cmd();

		if(time_sys-time_s_temp >= 1000)			//时间控制任务
		{
			time_s_temp +=1000;
			time_s++;
			if(LCDC.LCDPOFFTIME[LCD1_INDEX]<0xff)	//断电计时
			{
				LCDC.LCDPOFFTIME[LCD1_INDEX]++;
			}
			
			if(LCDC.LCDPOFFTIME[LCD2_INDEX]<0xff)	//断电计时
			{
				LCDC.LCDPOFFTIME[LCD2_INDEX]++;
			}
			
			LCDC.LCDPTime[LCD1_INDEX]++;		//广告计时
			LCDC.LCDPTime[LCD2_INDEX]++;
			
			LCDC.LCDSPTime[LCD1_INDEX]++;  //屏保时间
			LCDC.LCDSPTime[LCD2_INDEX]++;  //屏保时间
			//if((LCDC.LCDSPTime[LCD1_INDEX]-LCDC.LCDSPTime[LCD2_INDEX])<3)  //为了制造时差
			//{
			//	LCDC.LCDSPTime[LCD1_INDEX]++;
			//}
			//Dport_ChargeState();
			
			if((checking_portB&0xF0)==0x40)
			{
				ChargeCtrl_B();	//互斥上电
			}
			if((checking_portC&0xF0)==0x40)
			{
				ChargeCtrl_C();	//互斥上电
			}
			
			UART_BUFFER[0] ='1';//代表1号屏
			for(i=0;i<3;i++)
			{
				UART_BUFFER[1+i] = Dport_State[i]+'0';
			}
			UART_BUFFER[1+i] =0;
			tft_DisplayStr(0, 32, UART_BUFFER, POINT_COLOR, BACK_COLOR, 1);
			
			UART_BUFFER[0] ='2';  //代表2号屏
			for(i=0;i<3;i++)
			{
				UART_BUFFER[1+i] = Dport_State[3+i]+'0';
			}
			UART_BUFFER[1+i] =0;
			tft_DisplayStr(0, 32, UART_BUFFER, POINT_COLOR, BACK_COLOR,2);

			#if 0
			AnsiChardata[12] = Uport_PowerUseTime[0]/36000+'0';
			AnsiChardata[13] = Uport_PowerUseTime[0]%36000/3600+'0';
			AnsiChardata[19] = Uport_PowerUseTime[0]%3600/600+'0';
			AnsiChardata[20] = Uport_PowerUseTime[0]%600/60+'0';
			AnsiChardata[24] = Uport_PowerUseTime[0]%60/10+'0';
			AnsiChardata[25] = Uport_PowerUseTime[0]%10+'0';
			#endif
			
			if(LCDC.LCDSPPID[LCD1_INDEX]==2)
			{
				display_flash_BMPE (18,120,3,((Uport_PowerShowTime[0]%3600/600)+'0'),1);//时间 分H
				display_flash_BMPE (18,141,3,((Uport_PowerShowTime[0]%600/60)+'0'),1);//时间 分L
				display_flash_BMPE (18,176,3,((Uport_PowerShowTime[0]%60/10)+'0'),1);//时间 秒H
				display_flash_BMPE (18,197,3,((Uport_PowerShowTime[0]%10)+'0'),1);//时间 秒L
			}

			if(Uport_PowerUseTime[0]>0)
			{
				Uport_PowerUseTime[0]--;
				//GPIO_SetBits(LED1_PORT, LED1_PIN);
				LCDC.LCDPOFFTIME[LCD1_INDEX]=0; //断电计时
			}
			else
			{
				//GPIO_ResetBits(LED1_PORT, LED1_PIN);
				Dport_ChargeOFF(0);
				Dport_ChargeOFF(1);
				Dport_ChargeOFF(2);
				Dport_State[0] = 0;
				Dport_State[1] = 0;
				Dport_State[2] = 0;
				LCDC.LCDPTime[LCD1_INDEX]=0;		//广告计时
			}

			if(Uport_PowerShowTime[0]>0)
			{
				Uport_PowerShowTime[0]--;
				GPIO_SetBits(LED1_PORT, LED1_PIN);
			}
			else
			{
				GPIO_ResetBits(LED1_PORT, LED1_PIN);
			}

			if(LCDC.LCDPOFFTIME[LCD1_INDEX]==1)  //断电1秒调文字
			{
				FiletoBuffer_ID(2,48,LCD_TxtBuffer[LCD1_INDEX]);
				LCD_TxtBuffer[LCD1_INDEX][2048]=0;
				LCD_TxtBuffer[LCD1_INDEX][2049]=0;
			}
			else
				if(LCDC.LCDPOFFTIME[LCD1_INDEX]==5)  //断电后5秒调文字
				{
					LCDC.LCDSPTime[LCD1_INDEX] = 0;  //屏保时间
					LCDC.LCDSPPID[LCD1_INDEX] = 0;
					display_flash_BMPE (0,0,3,LCDC.LCDSPPID[LCD1_INDEX],1);//单色彩色都支持 调背景
					DisplayPROT_EWM(80,56,0,1);  //128
					tft_DisplayStr(270, 125, device_num,0x0000,0xffff,1);
				}

			#if 0
			AnsiChardata[12] = Uport_PowerUseTime[1]/36000+'0';
			AnsiChardata[13] = Uport_PowerUseTime[1]%36000/3600+'0';
			AnsiChardata[19] = Uport_PowerUseTime[1]%3600/600+'0';
			AnsiChardata[20] = Uport_PowerUseTime[1]%600/60+'0';
			AnsiChardata[24] = Uport_PowerUseTime[1]%60/10+'0';
			AnsiChardata[25] = Uport_PowerUseTime[1]%10+'0';
			#endif
			if(LCDC.LCDSPPID[LCD2_INDEX]==2)
			{
				display_flash_BMPE (18,120,3,((Uport_PowerShowTime[1]%3600/600)+'0'),2);//时间 分H
				display_flash_BMPE (18,141,3,((Uport_PowerShowTime[1]%600/60)+'0'),2);//时间 分L
				display_flash_BMPE (18,176,3,((Uport_PowerShowTime[1]%60/10)+'0'),2);//时间 秒H
				display_flash_BMPE (18,197,3,((Uport_PowerShowTime[1]%10)+'0'),2);//时间 秒L
			}


			if(Uport_PowerUseTime[1]>0)
			{				
				//			GPIO_SetBits(LED2_PORT, LED2_PIN);
				Uport_PowerUseTime[1]--;
				LCDC.LCDPOFFTIME[LCD2_INDEX]=0;     //断电计时
			}
			else
			{
				//			GPIO_ResetBits(LED2_PORT, LED2_PIN);
				Dport_ChargeOFF(3);
				Dport_ChargeOFF(4);
				Dport_ChargeOFF(5);
				Dport_State[3] = 0;
				Dport_State[4] = 0;
				Dport_State[5] = 0;
				LCDC.LCDPTime[LCD2_INDEX]=0;		//广告计时
			}

			if(Uport_PowerShowTime[1]>0)
			{
				Uport_PowerShowTime[1]--;
				GPIO_SetBits(LED2_PORT, LED2_PIN);
			}
			else
			{
				GPIO_ResetBits(LED2_PORT, LED2_PIN);
			}

			if(LCDC.LCDPOFFTIME[LCD2_INDEX]==1)  //断电后一秒调文字
			{
				FiletoBuffer_ID(2,48,LCD_TxtBuffer[LCD2_INDEX]);
				LCD_TxtBuffer[LCD2_INDEX][2048]=0;
				LCD_TxtBuffer[LCD2_INDEX][2049]=0;
			}
			else
				if(LCDC.LCDPOFFTIME[LCD2_INDEX]==5)  //断电后5秒调文字
				{
					LCDC.LCDSPTime[LCD2_INDEX] = 0;  //屏保时间
					LCDC.LCDSPPID[LCD2_INDEX] = 0;
					display_flash_BMPE (0,0,3,LCDC.LCDSPPID[LCD2_INDEX],2);//单色彩色都支持 调背景
					DisplayPROT_EWM(80,56,1,2);  //128
					tft_DisplayStr(270, 125, device_num,0x0000,0xffff,2);
				}
		}

		uart1_cmd();			
		uart3_cmd();		

		if((time_sys-time_sys_temp1 >= 1000))			//时间控制任务
		{
			time_sys_temp1 +=1000;
			if(LCDC.LCDSPPID[LCD1_INDEX]==2)
			{
				//tft_1bitdeep_TXT (18, 0, LCD_TxtBuffer[LCD1_INDEX],POINT_COLOR, BACK_COLOR,1);
				tft_1bitdeep_TXT (87, 0, LCD_TxtBuffer[LCD1_INDEX],POINT_COLOR, 0xffff,1);
			}
		}

		uart1_cmd();			
		uart3_cmd();		

		if((time_sys-time_sys_temp2 >= 1000))			//时间控制任务
		{
			time_sys_temp2 +=1000;
			if(LCDC.LCDSPPID[LCD2_INDEX]==2)
			{
				//tft_1bitdeep_TXT (18, 0, LCD_TxtBuffer[LCD2_INDEX],POINT_COLOR, BACK_COLOR,2);
				tft_1bitdeep_TXT (87, 0, LCD_TxtBuffer[LCD2_INDEX],POINT_COLOR, 0xffff,2);
			}
		}

		uart1_cmd();			
		uart3_cmd();
		
		if(time_sys-time_sys_temp3 >= 2000)			//时间控制任务
		{
			time_sys_temp3 +=2000;
			if((time_s-testcmd3_time)>=5)  //0x16 0xe2都有确认连接功能
			{
				UART_BUFFER[0] = 'U';
				//UART_BUFFER[1] = 'n';
				//UART_BUFFER[2] = 'l';
				//UART_BUFFER[3] = 'i';
				//UART_BUFFER[4] = 0;
				UART_BUFFER[1] = (device.addr>>4)+'0';
				UART_BUFFER[2] = (device.addr&0x0f)+'0';
				UART_BUFFER[3] = 0;
				if((time_s-testcmd1_time)>=30)  //30秒没收到正确命令认为断开连接
				{
					UART_BUFFER[0] = 'u';
				}
				tft_DisplayStr(0, 0, UART_BUFFER,POINT_COLOR, BACK_COLOR,3);
				GPIO_ResetBits(RJ45_IO1_PORT, RJ45_IO1_PIN);
			}
			else
			{
				UART_BUFFER[0] = 'L';
				//UART_BUFFER[1] = 'i';
				//UART_BUFFER[2] = 'n';
				//UART_BUFFER[3] = 'k';
				//UART_BUFFER[4] = 0;
				UART_BUFFER[1] = (device.addr>>4)+'0';
				UART_BUFFER[2] = (device.addr&0x0f)+'0';
				UART_BUFFER[3] = 0;
				if((time_s-testcmd1_time)>=30)  //30秒没收到正确命令认为断开连接
				{
					UART_BUFFER[0] = 'l';
				}
				tft_DisplayStr(0, 0, UART_BUFFER,POINT_COLOR, BACK_COLOR,3);
			}
		}

		if(Uport_PowerUseTime[0]>0)
		{
			Dport_ChargeStateB();
		}
		else
		{
			checking_portB = 0x00;  //SUB置空
		}

		if(Uport_PowerUseTime[1]>0)
		{
			Dport_ChargeStateC();
		}
		else
		{
			checking_portC = 0x00;  //SUB置空
		}
		
		update_screen_protect(LCD1_INDEX);

		uart1_cmd();			
		uart3_cmd();

		update_screen_protect(LCD2_INDEX);

		update_advertisement(LCD1_INDEX);
		update_advertisement(LCD2_INDEX);
		
		uart1_cmd();			
		uart3_cmd();

		LCD_into_power_on_state(LCD1_INDEX);
		LCD_into_power_on_state(LCD2_INDEX);
	}
}

/* ------------------------------------------end of file---------------------------------------- */

